In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
df = pd.read_csv("../data/cities.csv")

In [7]:
df["names"] = df["names"].apply(lambda x: x.strip())

In [8]:
df

                   names                         cords
0         Youngstown, OH    -5572.57       2839.81
1            Yankton, SD    -6729.21       2962.82
2             Yakima, WA    -8326.72       3219.84
3          Worcester, MA    -4961.07       2920.67
4    Wisconsin Dells, WI    -6202.70       3014.64
..                   ...                           ...
123             Reno, NV    -8278.33       2730.66
124           Regina, SA    -7230.86       3483.78
125        Red Bluff, CA    -8446.23       2776.26
126          Reading, PA    -5246.43       2786.63
127          Ravenna, OH    -5613.31       2843.96

[128 rows x 2 columns]

In [9]:
df["cords"] = df["cords"].apply(lambda x: x.strip())

In [10]:
df

                   names                   cords
0         Youngstown, OH  -5572.57       2839.81
1            Yankton, SD  -6729.21       2962.82
2             Yakima, WA  -8326.72       3219.84
3          Worcester, MA  -4961.07       2920.67
4    Wisconsin Dells, WI  -6202.70       3014.64
..                   ...                     ...
123             Reno, NV  -8278.33       2730.66
124           Regina, SA  -7230.86       3483.78
125        Red Bluff, CA  -8446.23       2776.26
126          Reading, PA  -5246.43       2786.63
127          Ravenna, OH  -5613.31       2843.96

[128 rows x 2 columns]

In [15]:
df2 = pd.DataFrame([[float(cord) for cord in xy_cord.split()] for xy_cord in df["cords"].values], columns=["x", "y"])
df2

           x        y
0   -5572.57  2839.81
1   -6729.21  2962.82
2   -8326.72  3219.84
3   -4961.07  2920.67
4   -6202.70  3014.64
..       ...      ...
123 -8278.33  2730.66
124 -7230.86  3483.78
125 -8446.23  2776.26
126 -5246.43  2786.63
127 -5613.31  2843.96

[128 rows x 2 columns]

In [16]:
df2["name"] = df["names"]

In [17]:
df2

           x        y                 name
0   -5572.57  2839.81       Youngstown, OH
1   -6729.21  2962.82          Yankton, SD
2   -8326.72  3219.84           Yakima, WA
3   -4961.07  2920.67        Worcester, MA
4   -6202.70  3014.64  Wisconsin Dells, WI
..       ...      ...                  ...
123 -8278.33  2730.66             Reno, NV
124 -7230.86  3483.78           Regina, SA
125 -8446.23  2776.26        Red Bluff, CA
126 -5246.43  2786.63          Reading, PA
127 -5613.31  2843.96          Ravenna, OH

[128 rows x 3 columns]